/* ==================== 1. 头文件保护 ==================== */
#ifndef _TASK_COM_H_
#define _TASK_COM_H_

/* ==================== 2. 头文件包含 ==================== */
#include <stdint.h>

/* ==================== 3. 宏定义 ==================== */
/* 无 */

/* ==================== 4. 类型定义 ==================== */
/* 无 */

/* ==================== 5. 外部全局变量声明 ==================== */
extern volatile uint8_t meter_com_flag;

/* ==================== 6. 外部函数声明 ==================== */
void task_com_init(void);
void task_com_suspend(void);
void task_com_resume(void);

/* ==================== 7. 结束头文件保护 ==================== */
#endif /* _TASK_COM_H_ */
