/*
	Ӧ��˵����
	�ڷ���I2C�豸ǰ�����ȵ��� i2c_CheckDevice() ���I2C�豸�Ƿ��������ú���������GPIO
*/

#include "bsp.h"
#include "bsp_i2c_gpio.h"

/* ����I2C�������ӵ�GPIO�˿�, �û�ֻ��Ҫ�޸�����4�д��뼴������ı�SCL��SDA������ */
#define I2C_SCL_GPIO	GPIOB			/* ���ӵ�SCLʱ���ߵ�GPIO */
#define I2C_SDA_GPIO	GPIOB			/* ���ӵ�SDA�����ߵ�GPIO */

#define I2C_SCL_PIN		GPIO_PIN_10			/* ���ӵ�SCLʱ���ߵ�GPIO */
#define I2C_SDA_PIN		GPIO_PIN_11			/* ���ӵ�SDA�����ߵ�GPIO */

#define ALL_I2C_GPIO_CLK_ENABLE()	__HAL_RCC_GPIOB_CLK_ENABLE()

/* �����дSCL��SDA�ĺ� */
#define I2C_SCL_1()  I2C_SCL_GPIO->BSRR = I2C_SCL_PIN				/* SCL = 1 */
#define I2C_SCL_0()  I2C_SCL_GPIO->BSRR = ((uint32_t)I2C_SCL_PIN << 16U)				/* SCL = 0 */

#define I2C_SDA_1()  I2C_SDA_GPIO->BSRR = I2C_SDA_PIN				/* SDA = 1 */
#define I2C_SDA_0()  I2C_SDA_GPIO->BSRR = ((uint32_t)I2C_SDA_PIN << 16U)				/* SDA = 0 */


#define I2C_SDA_READ()  ((I2C_SDA_GPIO->IDR & I2C_SDA_PIN) != 0)	/* ��SDA����״̬ */
#define I2C_SCL_READ()  ((I2C_SCL_GPIO->IDR & I2C_SCL_PIN) != 0)	/* ��SCL����״̬ */

#define I2C_2_SCL_GPIO	GPIOB			/* ���ӵ�SCLʱ���ߵ�GPIO */
#define I2C_2_SDA_GPIO	GPIOB			/* ���ӵ�SDA�����ߵ�GPIO */

#define I2C_2_SCL_PIN		GPIO_PIN_6			/* ���ӵ�SCLʱ���ߵ�GPIO */
#define I2C_2_SDA_PIN		GPIO_PIN_7		/* ���ӵ�SDA�����ߵ�GPIO */

#define ALL_I2C_2_GPIO_CLK_ENABLE()	__HAL_RCC_GPIOB_CLK_ENABLE()

/* �����дSCL��SDA�ĺ� */
#define I2C_2_SCL_1()  I2C_SCL_GPIO->BSRR = I2C_2_SCL_PIN				/* SCL = 1 */
#define I2C_2_SCL_0()  I2C_SCL_GPIO->BSRR = ((uint32_t)I2C_2_SCL_PIN << 16U)				/* SCL = 0 */

#define I2C_2_SDA_1()  I2C_SDA_GPIO->BSRR = I2C_2_SDA_PIN				/* SDA = 1 */
#define I2C_2_SDA_0()  I2C_SDA_GPIO->BSRR = ((uint32_t)I2C_2_SDA_PIN << 16U)				/* SDA = 0 */


#define I2C_2_SDA_READ()  ((I2C_2_SCL_GPIO->IDR & I2C_2_SDA_PIN) != 0)	/* ��SDA����״̬ */
#define I2C_2_SCL_READ()  ((I2C_2_SCL_GPIO->IDR & I2C_2_SCL_PIN) != 0)	/* ��SCL����״̬ */

/*
*********************************************************************************************************
*	�� �� ��: bsp_InitI2C
*	����˵��: ����I2C���ߵ�GPIO������ģ��IO�ķ�ʽʵ��
*	��    ��:  ��
*	�� �� ֵ: ��
*********************************************************************************************************
*/
void bsp_InitI2C(void)
{
    GPIO_InitTypeDef gpio_init;

    /* ��1������GPIOʱ�� */
    ALL_I2C_GPIO_CLK_ENABLE();

    gpio_init.Mode = GPIO_MODE_OUTPUT_OD;	/* ���ÿ�©��� */
    gpio_init.Pull = GPIO_NOPULL;			/* ���������費ʹ�� */
    gpio_init.Speed = GPIO_SPEED_FREQ_LOW;	// GPIO_SPEED_FREQ_HIGH;  /* GPIO�ٶȵȼ� */

    gpio_init.Pin = I2C_SCL_PIN;
    HAL_GPIO_Init(I2C_SCL_GPIO, &gpio_init);

    gpio_init.Pin = I2C_SDA_PIN;
    HAL_GPIO_Init(I2C_SDA_GPIO, &gpio_init);

    /* ��һ��ֹͣ�ź�, ��λI2C�����ϵ������豸������ģʽ */
    i2c_Stop();

    /* ��1������GPIOʱ�� */

}

void bsp_InitI2C_2(void){
//	    GPIO_InitTypeDef gpio_init;
//    ALL_I2C_2_GPIO_CLK_ENABLE();
//
//    gpio_init.Mode = GPIO_MODE_OUTPUT_OD;	/* ���ÿ�©��� */
//    gpio_init.Pull = GPIO_NOPULL;			/* ���������費ʹ�� */
//    gpio_init.Speed = GPIO_SPEED_HIGH;	// GPIO_SPEED_FREQ_HIGH;  /* GPIO�ٶȵȼ� */
//
//    gpio_init.Pin = I2C_2_SCL_PIN;
//    HAL_GPIO_Init(I2C_2_SCL_GPIO, &gpio_init);
//
//    gpio_init.Pin = I2C_2_SDA_PIN;
//    HAL_GPIO_Init(I2C_2_SDA_GPIO, &gpio_init);
//
//    /* ��һ��ֹͣ�ź�, ��λI2C�����ϵ������豸������ģʽ */
//    i2c_Stop();
}

/*
*********************************************************************************************************
*	�� �� ��: i2c_Delay
*	����˵��: I2C����λ�ӳ٣����400KHz
*	��    ��:  ��
*	�� �� ֵ: ��
*********************************************************************************************************
*/
static void i2c_Delay(void)
{
    /*��
        CPU��Ƶ168MHzʱ�����ڲ�Flash����, MDK���̲��Ż�����̨ʽʾ�����۲Ⲩ�Ρ�
        ѭ������Ϊ5ʱ��SCLƵ�� = 1.78MHz (����ʱ: 92ms, ��д������������ʾ����̽ͷ���ϾͶ�дʧ�ܡ�ʱ��ӽ��ٽ�)
        ѭ������Ϊ10ʱ��SCLƵ�� = 1.1MHz (����ʱ: 138ms, ���ٶ�: 118724B/s)
        ѭ������Ϊ30ʱ��SCLƵ�� = 440KHz�� SCL�ߵ�ƽʱ��1.0us��SCL�͵�ƽʱ��1.2us

        ��������ѡ��2.2Kŷʱ��SCL������ʱ��Լ0.5us�����ѡ4.7Kŷ����������Լ1us

        ʵ��Ӧ��ѡ��400KHz���ҵ����ʼ���
    */
    //for (i = 0; i < 30; i++);
    //for (i = 0; i < 60; i++);
    //bsp_DelayUS(2); 229.57KHzʱ��
    bsp_delay_us(2);
}

/*
*********************************************************************************************************
*	�� �� ��: i2c_Start
*	����˵��: CPU����I2C���������ź�
*	��    ��:  ��
*	�� �� ֵ: ��
*********************************************************************************************************
*/
void i2c_Start(void)
{
    /* ��SCL�ߵ�ƽʱ��SDA����һ�������ر�ʾI2C���������ź� */
    I2C_SDA_1();
    I2C_SCL_1();
    i2c_Delay();
    I2C_SDA_0();
    i2c_Delay();

    I2C_SCL_0();
    i2c_Delay();
}

void i2c_2_Start(void)
{
    /* ��SCL�ߵ�ƽʱ��SDA����һ�������ر�ʾI2C���������ź� */
    I2C_2_SDA_1();
    I2C_2_SCL_1();
    i2c_Delay();
    I2C_2_SDA_0();
    i2c_Delay();

    I2C_2_SCL_0();
    i2c_Delay();
}

/*
*********************************************************************************************************
*	�� �� ��: i2c_Start
*	����˵��: CPU����I2C����ֹͣ�ź�
*	��    ��:  ��
*	�� �� ֵ: ��
*********************************************************************************************************
*/
void i2c_Stop(void)
{
    /* ��SCL�ߵ�ƽʱ��SDA����һ�������ر�ʾI2C����ֹͣ�ź� */
    I2C_SDA_0();
    i2c_Delay();
    I2C_SCL_1();
    i2c_Delay();
    I2C_SDA_1();
    i2c_Delay();
}

void i2c_2_Stop(void)
{
    /* ��SCL�ߵ�ƽʱ��SDA����һ�������ر�ʾI2C����ֹͣ�ź� */
    I2C_2_SDA_0();
    i2c_Delay();
    I2C_2_SCL_1();
    i2c_Delay();
    I2C_2_SDA_1();
    i2c_Delay();
}

/*
*********************************************************************************************************
*	�� �� ��: i2c_SendByte
*	����˵��: CPU��I2C�����豸����8bit����
*	��    ��:  _ucByte �� �ȴ����͵��ֽ�
*	�� �� ֵ: ��
*********************************************************************************************************
*/
void i2c_SendByte(uint8_t _ucByte)
{
    uint8_t i;

    /* �ȷ����ֽڵĸ�λbit7 */
    for (i = 0; i < 8; i++)
    {
        if (_ucByte & 0x80)
        {
            I2C_SDA_1();
        }
        else
        {
            I2C_SDA_0();
        }
        i2c_Delay();
        I2C_SCL_1();
        i2c_Delay();
        I2C_SCL_0();
        I2C_SCL_0();	/* 2019-03-14 ���GT811���ݴ���������һ�У��൱���ӳټ�ʮns */
        if (i == 7)
        {
            I2C_SDA_1(); // �ͷ�����
        }
        _ucByte <<= 1;	/* ����һ��bit */
    }
}
void i2c_2_SendByte(uint8_t _ucByte)
{
    uint8_t i;

    /* �ȷ����ֽڵĸ�λbit7 */
    for (i = 0; i < 8; i++)
    {
        if (_ucByte & 0x80)
        {
            I2C_2_SDA_1();
        }
        else
        {
            I2C_2_SDA_0();
        }
        i2c_Delay();
        I2C_2_SCL_1();
        i2c_Delay();
        I2C_2_SCL_0();
        I2C_2_SCL_0();	/* 2019-03-14 ���GT811���ݴ���������һ�У��൱���ӳټ�ʮns */
        if (i == 7)
        {
            I2C_2_SDA_1(); // �ͷ�����
        }
        _ucByte <<= 1;	/* ����һ��bit */
    }
}
/*
*********************************************************************************************************
*	�� �� ��: i2c_ReadByte
*	����˵��: CPU��I2C�����豸��ȡ8bit����
*	��    ��:  ��
*	�� �� ֵ: ����������
*********************************************************************************************************
*/
uint8_t i2c_ReadByte(void)
{
    uint8_t i;
    uint8_t value;

    /* ������1��bitΪ���ݵ�bit7 */
    value = 0;
    for (i = 0; i < 8; i++)
    {
        value <<= 1;
        I2C_SCL_1();
        i2c_Delay();
        if (I2C_SDA_READ())
        {
            value++;
        }
        I2C_SCL_0();
        i2c_Delay();
    }
    return value;
}

uint8_t i2c_2_ReadByte(void)
{
    uint8_t i;
    uint8_t value;

    /* ������1��bitΪ���ݵ�bit7 */
    value = 0;
    for (i = 0; i < 8; i++)
    {
        value <<= 1;
        I2C_2_SCL_1();
        i2c_Delay();
        if (I2C_2_SDA_READ())
        {
            value++;
        }
        I2C_2_SCL_0();
        i2c_Delay();
    }
    return value;
}
/*
*********************************************************************************************************
*	�� �� ��: i2c_WaitAck
*	����˵��: CPU����һ��ʱ�ӣ�����ȡ������ACKӦ���ź�
*	��    ��:  ��
*	�� �� ֵ: ����0��ʾ��ȷӦ��1��ʾ��������Ӧ
*********************************************************************************************************
*/
uint8_t i2c_WaitAck(void)
{
    uint8_t re;

    I2C_SDA_1();	/* CPU�ͷ�SDA���� */
    i2c_Delay();
    I2C_SCL_1();	/* CPU����SCL = 1, ��ʱ�����᷵��ACKӦ�� */
    i2c_Delay();
    if (I2C_SDA_READ())	/* CPU��ȡSDA����״̬ */
    {
        re = 1;
    }
    else
    {
        re = 0;
    }
    I2C_SCL_0();
    i2c_Delay();
    return re;

}

uint8_t i2c_2_WaitAck(void)
{
    uint8_t re;

    I2C_2_SDA_1();	/* CPU�ͷ�SDA���� */
    i2c_Delay();
    I2C_2_SCL_1();	/* CPU����SCL = 1, ��ʱ�����᷵��ACKӦ�� */
    i2c_Delay();
    if (I2C_2_SDA_READ())	/* CPU��ȡSDA����״̬ */
    {
        re = 1;
    }
    else
    {
        re = 0;
    }
    I2C_2_SCL_0();
    i2c_Delay();
    return re;

}

/*
*********************************************************************************************************
*	�� �� ��: i2c_Ack
*	����˵��: CPU����һ��ACK�ź�
*	��    ��:  ��
*	�� �� ֵ: ��
*********************************************************************************************************
*/
void i2c_Ack(void)
{
    I2C_SDA_0();	/* CPU����SDA = 0 */
    i2c_Delay();
    I2C_SCL_1();	/* CPU����1��ʱ�� */
    i2c_Delay();
    I2C_SCL_0();
    i2c_Delay();
    I2C_SDA_1();	/* CPU�ͷ�SDA���� */

    i2c_Delay();
}
void i2c_2_Ack(void)
{
    I2C_2_SDA_0();	/* CPU����SDA = 0 */
    i2c_Delay();
    I2C_2_SCL_1();	/* CPU����1��ʱ�� */
    i2c_Delay();
    I2C_2_SCL_0();
    i2c_Delay();
    I2C_2_SDA_1();	/* CPU�ͷ�SDA���� */

    i2c_Delay();
}
/*
*********************************************************************************************************
*	�� �� ��: i2c_NAck
*	����˵��: CPU����1��NACK�ź�
*	��    ��:  ��
*	�� �� ֵ: ��
*********************************************************************************************************
*/
void i2c_NAck(void)
{
    I2C_SDA_1();	/* CPU����SDA = 1 */
    i2c_Delay();
    I2C_SCL_1();	/* CPU����1��ʱ�� */
    i2c_Delay();
    I2C_SCL_0();
    i2c_Delay();
}
void i2c_2_NAck(void)
{
    I2C_2_SDA_1();	/* CPU����SDA = 1 */
    i2c_Delay();
    I2C_2_SCL_1();	/* CPU����1��ʱ�� */
    i2c_Delay();
    I2C_2_SCL_0();
    i2c_Delay();
}
/*
*********************************************************************************************************
*	�� �� ��: i2c_CheckDevice
*	����˵��: ���I2C�����豸��CPU�����豸��ַ��Ȼ���ȡ�豸Ӧ�����жϸ��豸�Ƿ����
*	��    ��:  _Address���豸��I2C���ߵ�ַ
*	�� �� ֵ: ����ֵ 0 ��ʾ��ȷ�� ����1��ʾδ̽�⵽
*********************************************************************************************************
*/
uint8_t i2c_CheckDevice(uint8_t _Address)
{
    uint8_t ucAck;

    if (I2C_SDA_READ() && I2C_SCL_READ())
    {
        i2c_Start();		/* ���������ź� */

        /* �����豸��ַ+��д����bit��0 = w�� 1 = r) bit7 �ȴ� */
        i2c_SendByte(_Address | I2C_WR);
        ucAck = i2c_WaitAck();	/* ����豸��ACKӦ�� */

        i2c_Stop();			/* ����ֹͣ�ź� */

        return ucAck;
    }
    return 1;	/* I2C�����쳣 */
}


